# Cписки в Python

# Создание пустого списка
# my_list = []
# text = ' '
# text_list = list(my_list)
# print(text_list)

# ------------------------------------------------------------

# Создание списка с начальными элементами
# b = 4325
# my_list = [1, 2, 'три', 4, 5, True, b]

# ------------------------------------------------------------

# Работа с элементами списка (индексация элементов)
# num = my_list[0]
# my_list[0] = 5
# my_list[-1] = 3

# ------------------------------------------------------------

# Проход (итерирование) вдоль элементов списка (слева направо)
# my_list = [1, 2, 3, 4, 5]
# for elem in my_list:
#     print(elem)
# print('Конец списка!')

# ------------------------------------------------------------

# Получение длины списка (кол-во элементов внутри списка)
# len() - возвращает длину списка
# my_list = [1, 2, 3, 4, 5, 6, 7, 8]
# len_list = len(my_list)
# print(len_list)

# ------------------------------------------------------------

# Получение суммы элементов списка
# my_list = [1, 2, 3, 4, 5, 6, 7, 8]
# print(sum(my_list) / len(my_list))

# ------------------------------------------------------------

# Получение макс. и мин. элементов списка
# my_list = [1, 2, 3, 4, 5, 6, 7, 8]
# print(max(my_list))
# print(min(my_list))

# ------------------------------------------------------------

# Изменение списка

# Добавление элементов в список
# append() - добавление элемента в конец списка
# insert() - добавление элемента по указанному индексу
# my_list = [1, 2, 3, 4]
# my_list.append(5)
# my_list.insert(0, 5)
# print(my_list)

# ------------------------------------------------------------

# Удаление элементов из списка
# remove() - удаляет первое вхождение указанного элемента из списка
# my_list = [5, 1, 2, 3, 4, 5]
# my_list.remove(5)
# print(my_list)

# del - удаляет элемент из списка по указанному индексу
# my_list = [1, 2, 3, 4, 5]
# del my_list[0]
# print(my_list)

# ------------------------------------------------------------

# Проверка наличия элемента в списке
# Оператор in позволяет проверить, есть ли указанный элемент в списке
# my_list = [1, 2, 3, 4, 5]
# if 5 in my_list:
#     print('Элемент есть')
# else:
#     print('Элемента нет')

# ------------------------------------------------------------

# Объединение двух списков
# list1 = [1, 2, 3]
# list2 = ['один', 'два', 'три']
# new_list = list2 + list1
# print(new_list)

# ------------------------------------------------------------

# Итерирование вдоль списка с помощью for и функции range()
# my_list = [1, 2, 3, 4, 5]

# for i in range(len(my_list)):
#     print(my_list[i])

# for i in range(len(my_list) - 1):
#     print(my_list[i], my_list[i + 1])

# ------------------------------------------------------------

# Сортировка списка

# my_list = [3, 8, 64, 4, 432, 65]
# my_list.sort()
# my_list.sort(reverse = True)
# print(my_list.sort())

# sort_list = sorted(my_list)
# sort_list = sorted(my_list, reverse=True)

# ------------------------------------------------------------

# Функция для разворота списка
# my_list = [123, -123, 45, 1353, 112]
# my_list.reverse()
# print(my_list)
